In [2]:
import sqlite3 as sq3

## Connect , Create DB & Create Table

In [3]:
conn = sq3.connect('example.db')
cursor = conn.cursor()

cursor.execute("""CREATE TABLE students(roll INT PRIMARY KEY, name TEXT, age INT)""" )
conn.close()

## Inserting Data

In [11]:
with sq3.connect('example.db') as conn:
    cursor = conn.cursor()
    cursor.execute(
        """INSERT INTO students VALUES(?,?,?)""", (
            5,"Emon" , 36
        )
    )

In [25]:
users = []
for roll in range(6,20):
    user = (roll, f"User{roll}", roll+5)
    users.append(user)
users

[(6, 'User6', 11),
 (7, 'User7', 12),
 (8, 'User8', 13),
 (9, 'User9', 14),
 (10, 'User10', 15),
 (11, 'User11', 16),
 (12, 'User12', 17),
 (13, 'User13', 18),
 (14, 'User14', 19),
 (15, 'User15', 20),
 (16, 'User16', 21),
 (17, 'User17', 22),
 (18, 'User18', 23),
 (19, 'User19', 24)]

In [26]:
with sq3.connect('example.db') as conn:
    cursor = conn.cursor()
    cursor.executemany(
        """INSERT INTO students VALUES(?,?,?)""", users
    )

## Fetching Data from DB

In [27]:
with sq3.connect('example.db') as conn:
    cursor = conn.cursor()
    result = cursor.execute(
        """SELECT * FROM students"""
    )
    print(list(result))

[(1, 'Jahidur Rahman', 24), (2, 'Nasir', 26), (3, 'Emon', 30), (4, 'Emon', 35), (5, 'Emon', 36), (6, 'User6', 11), (7, 'User7', 12), (8, 'User8', 13), (9, 'User9', 14), (10, 'User10', 15), (11, 'User11', 16), (12, 'User12', 17), (13, 'User13', 18), (14, 'User14', 19), (15, 'User15', 20), (16, 'User16', 21), (17, 'User17', 22), (18, 'User18', 23), (19, 'User19', 24)]

[(0, 'User0', 5),
 (1, 'User1', 6),
 (2, 'User2', 7),
 (3, 'User3', 8),
 (4, 'User4', 9),
 (5, 'User5', 10),
 (6, 'User6', 11),
 (7, 'User7', 12),
 (8, 'User8', 13),
 (9, 'User9', 14),
 (10, 'User10', 15),
 (11, 'User11', 16),
 (12, 'User12', 17),
 (13, 'User13', 18),
 (14, 'User14', 19),
 (15, 'User15', 20),
 (16, 'User16', 21),
 (17, 'User17', 22),
 (18, 'User18', 23),
 (19, 'User19', 24)]

In [31]:
with sq3.connect('example.db') as conn:
    cursor = conn.cursor()
    result = cursor.execute(
        """SELECT roll ,name,age FROM students where roll=7"""
    )
    print(list(result))

[(7, 'User7', 50)]

In [14]:
with sq3.connect('example.db') as conn:
    cursor = conn.cursor()
    result = cursor.execute(
        """SELECT roll ,name FROM students where age>=30"""
    )
    print(list(result))

[(3, 'Emon'), (4, 'Emon'), (5, 'Emon')]

In [16]:
with sq3.connect('example.db') as conn:
    cursor = conn.cursor()
    result = cursor.execute(
        """SELECT roll ,name, MAX(age) FROM students"""
    )
    print(list(result))

[(5, 'Emon', 36)]

## Update Command

In [29]:
with sq3.connect('example.db') as conn:
    cursor = conn.cursor()
    result = cursor.execute(
        """UPDATE students SET age=50 where roll=7"""
    )

## Drop Table

In [ ]:
with sq3.connect('example.db') as conn:
    cursor = conn.cursor()
    cursor.execute(
        """DROP table if exists students"""
    )

# Create a table college students(roll,name,age,dept,contact)

In [32]:
conn = sq3.connect('example.db')
cursor = conn.cursor()

cursor.execute(
    """CREATE TABLE collegestudents(roll INT PRIMARY KEY, name TEXT, age INT,deptname TEXT, contact INT)""")
conn.close()

## Inserting value

In [36]:
with sq3.connect('example.db') as conn:
    cursor = conn.cursor()
    cursor.execute(
        """INSERT INTO collegestudents VALUES(?,?,?,?,?)""", (
            1, "Nasir Uddin", 25, "CSE", 1724453709
        )
    )

In [37]:
with sq3.connect('example.db') as conn:
    cursor = conn.cursor()
    result = cursor.execute(
        """SELECT * FROM collegestudents """
    )
    print(list(result))

[(1, 'Nasir Uddin', 25, 'CSE', 1724453709)]

# Create a table for dept(id,name,sub,age,contact)

In [38]:
conn = sq3.connect('example.db')
cursor = conn.cursor()

cursor.execute(
    """CREATE TABLE dept(id INT PRIMARY KEY, name TEXT, sub TEXT,age INT, contact TEXT)""")
conn.close()

In [39]:
with sq3.connect('example.db') as conn:
    cursor = conn.cursor()
    cursor.execute(
        """INSERT INTO dept VALUES(?,?,?,?,?)""", (
            1, "Emon", "Science", 17, "01724453709"
        )
    )

In [40]:
with sq3.connect('example.db') as conn:
    cursor = conn.cursor()
    result = cursor.execute(
        """SELECT * FROM dept """
    )
    print(list(result))

[(1, 'Emon', 'Science', 17, '01724453709')]